app/controllers/apartments_controller.rb

  def index
    apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

  def create
    # create a new apartment
    apartment = Apartment.create(apartment_params)
---
INSERT INTO "apartments" ("street_1", "street_2", "city", "postal_code", "state", "country", "building_manager_name", "building_manager_phone", "building_manager_hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def show
    apartment = Apartment.find_by(id: params[:id])
---
SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    apartment = Apartment.update(apartment_params)
---
UPDATE "apartments" SET "city" = $1, "updated_at" = $2 WHERE "apartments"."id" = $3  [["city", "Seattle"], ["updated_at", "2018-09-20 00:12:39.323141"], ["id", 311]]

  def destroy
    apartment = Apartment.find_by(id: params[:id]).destroy
---
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 117]]
SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 117], ["LIMIT", 1]]